{
  "name": "SELECT/CASE",
  "description": "SELECT\nThis is a non-loop structure. Each item is only tested once. The general layout of the structure is:\nSELECT expression\nCASE int_value\nCASE int_value\n...\nCASE int_value\nOTHERWISE\nENDC\n\nSELECT expression\nThis is the beginning of the Case structure. The expression must resolve to an I type value.\nThe value will be used in comparisons by the individual CASE commands.\nThis command is generally used in menu type situations.\n\nCASE int_value\nThis part represents the choice in the SELECT structure. The int_value must be in the form of\na I type constant. For example:\nCASE 1\nIf the int_value matches the value generated by the appropriate SELECT expression, the lines\nafter the CASE command and continuing until the next CASE, OTHERWISE or ENDC",
  "syntax": "SELECT expression\nCASE int_value\nCASE int_value\n...\nCASE int_value\nOTHERWISE\nENDCASE",
  "keywords": [
    {
      "keyword": "CASE int_value",
      "description": "This part represents the choice in the SELECT structure. The int_value must be in the form of an I type constant. For example: CASE 1 If the int_value matches the value generated by the appropriate SELECT expression, the lines after the CASE command and continuing until the next CASE, OTHERWISE or ENDC"
    },
    {
      "keyword": "OTHERWISE",
      "description": "If none of the previous CASE values match that in the SELECT command, the program will always execute the lines between this OTHERWISE and the ENDC. This is much like the ELSE option within an IF/ENDIF structure."
    },
    {
      "keyword": "ENDCASE",
      "description": "This is the end of the SELECT/CASE/ENDC structure. Each SELECT must have an ENDC to finish the structure. If the ENDC is not included an error message will be displayed during compilation."
    }
  ],
  "max_nesting": "20 deep",
  "example": "SELECT counter && counter might be a value received from a menu.\nCASE 1\n...\n...\n&& group 1\n...\nCASE 2\n...\n...\n&& group 2\n...\nCASE 3\n...\n...\n&& group 3\n...\nOTHERWISE\n...\n...\n&& group 4\n...\nENDC"
}